api/app/controllers/family/portal_controller.rb

SELECT "family_accesses".* FROM "family_accesses" WHERE "family_accesses"."access_token" = ? AND "family_accesses"."active" = ? LIMIT ?  [["access_token", "[FILTERED]"], ["active", 1], ["LIMIT", 1]]
---
    def set_access
      @access = FamilyAccess.find_by(access_token: params[:token], active: true)