api/app/controllers/auth_controller.rb

SELECT "clinics".* FROM "clinics" WHERE "clinics"."slug" = ? LIMIT ?  [["slug", "tea-auth"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = ? AND "users"."clinic_id" = ? LIMIT ?  [["email", "[FILTERED]"], ["clinic_id", 1], ["LIMIT", 1]]
---
  def login
    clinic = Clinic.find_by(slug: params[:clinic_slug])
    user = User.unscoped.find_by(email: params[:email], clinic_id: clinic&.id)

INSERT INTO "clinics" ("created_at", "email", "name", "phone", "plan", "slug", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "users" ("clinic_id", "created_at", "email", "name", "password_digest", "role", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def register
    clinic = Clinic.new(params.require(:clinic).permit(:name, :slug, :email, :phone))
    user_params = params.require(:user).permit(:name, :email, :password)

    ActiveRecord::Base.transaction do
      clinic.save!
      user = User.new(user_params.merge(role: "admin", clinic: clinic))
      user.save!