api/app/controllers/goal_progresses_controller.rb

INSERT INTO "goal_progresses" ("created_at", "goal_id", "notes", "recorded_at", "score", "session_id", "therapist_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    goal = TherapeuticGoal.find(params[:therapeutic_goal_id])
    progress = goal.goal_progresses.new(progress_params)
    if progress.save