api/app/controllers/patients_controller.rb

  def create
    patient = Patient.new(patient_params)
    patient.clinic_id = Current.clinic_id
    if patient.save
---
INSERT INTO "patients" ("birth_date", "clinic_id", "communication_method", "created_at", "diagnosis_date", "diagnosis_level", "name", "notes", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"