api/app/controllers/therapeutic_goals_controller.rb

  def create
    goal = TherapeuticGoal.new(goal_params)
    goal.clinic_id = Current.clinic_id
    if goal.save
---
INSERT INTO "therapeutic_goals" ("achieved_at", "clinic_id", "created_at", "description", "domain", "method", "patient_id", "started_at", "status", "target", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"