api/app/controllers/therapy_sessions_controller.rb

  def create
    session = TherapySession.new(session_params)
    session.clinic_id = Current.clinic_id
    if session.save
---
INSERT INTO "therapy_sessions" ("clinic_id", "created_at", "duration_minutes", "modality", "patient_id", "scheduled_at", "session_notes", "status", "therapist_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"